diplom/src/DataProcessors/ВКМ_МассовоеСозданиеАктов/ВКМ_МассовоеСозданиеАктов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ВКМ_МассовоеСозданиеАктов</name>
  <attributes>
    <name>Период</name>
    <type>
      <types>StandardPeriod</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокРеализаций</name>
  </tabularSections>
</mdclass:DataProcessor>

diplom/src/Documents/РеализацияТоваровУслуг/РеализацияТоваровУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РеализацияТоваровУслуг</name>
  <registerRecords>AccumulationRegister.ОстаткиТоваров</registerRecords>
  <registerRecords>AccumulationRegister.ВКМ_ВыполненныеКлиентуРаботы</registerRecords>
  <registerRecords>AccumulationRegister.ОбработкаЗаказов</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Услуги</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ФормаДокумента</name>
  </tabularSections>
</mdclass:Document>

diplom/src/DataProcessors/ВКМ_МассовоеСозданиеАктов/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

// Создаёт список реализаций за указанный период.
// Если есть реализация, то она добавляется в массив.
// Если нет реализации, то она сначала слздаётся и потом добавляется в массив.
// 
// Параметры:
// ДатаНачала - Дата
// ДатаОкончания - Дата
// 
// Возвращаемое значение:
//  - Массив из ДокументСсылка.РеализацияТоваровУслуг
Функция СоздатьСписокНаСервере(ДатаНачала, ДатаОкончания) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДоговорыКонтрагентов.Ссылка КАК Договор,
		|	ДоговорыКонтрагентов.Организация КАК Организация,
		|	ДоговорыКонтрагентов.Владелец КАК Владелец,
		|	ДоговорыКонтрагентов.ВКМ_СуммаАбонентскойПлаты КАК АбонентскаяПлата
		|ПОМЕСТИТЬ ВТ_Договоры
		|ИЗ
		|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
		|ГДЕ
		|	ДоговорыКонтрагентов.ВидДоговора = &ВидДоговора
		|	И ДоговорыКонтрагентов.ВКМ_ДатаНачалаДействияДоговора <= &ДатаОкончания
		|	И ДоговорыКонтрагентов.ВКМ_ДатаОкончанияДействияДоговора >= &ДатаНачала
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РеализацияТоваровУслуг.Договор.Ссылка КАК Реализации
		|ПОМЕСТИТЬ ВТ_Реализации
		|ИЗ
		|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		|ГДЕ
		|	РеализацияТоваровУслуг.Договор.ВидДоговора = &ВидДоговора
		|	И РеализацияТоваровУслуг.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
		|	И РеализацияТоваровУслуг.ПометкаУдаления = ЛОЖЬ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Договоры.Договор КАК Договор,
		|	ВТ_Договоры.Организация КАК Организация,
		|	ВТ_Договоры.Владелец КАК Владелец,
		|	ВТ_Договоры.АбонентскаяПлата КАК АбонентскаяПлата
		|ИЗ
		|	ВТ_Договоры КАК ВТ_Договоры
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Реализации КАК ВТ_Реализации
		|		ПО ВТ_Договоры.Договор.Ссылка = ВТ_Реализации.Реализации.Ссылка";
	
	Запрос.УстановитьПараметр("ВидДоговора", Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание);
	Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончания);
	Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
	
	Выборка = Запрос.Выполнить().Выбрать(); 
	
	СписокРеализацийМассив = Новый Массив;
		
	Пока Выборка.Следующий() Цикл
		
		СписокРеализацийСтруктура = Новый Структура;
		
		НоваяРеализация = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
		НоваяРеализация.Дата = ДатаОкончания; 
		НоваяРеализация.Ответственный = Пользователи.ТекущийПользователь(); 
		НоваяРеализация.Договор = Выборка.Договор;
		НоваяРеализация.Контрагент = Выборка.Владелец;
		НоваяРеализация.Организация = Выборка.Организация;
		НоваяРеализация.Основание = Выборка.Договор;
		НоваяРеализация.Комментарий = "Документ создан автоматической обработкой Массовое создание актов.";
		НоваяРеализация.ВКМ_ВыполнитьАвтозаполнение(Выборка.Договор);
		
		Если НоваяРеализация.ПроверитьЗаполнение() Тогда
			
			Попытка
				НоваяРеализация.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
				СписокРеализацийСтруктура.Вставить("Договор", Выборка.Договор);
				СписокРеализацийСтруктура.Вставить("Реализация", НоваяРеализация.Ссылка);	
			Исключение
				КоментВЖурнал = СтрШаблон("По клиенту ""%2"" по договору ""%1"" не удалось создать Реализацию. 
					|Дата документа не попадает в период действия договора. 
					|Укажите другую дату.", 
					Выборка.Договор, 
					Выборка.Владелец);
				ЗаписьЖурналаРегистрации("Обработка Массовое создание актов", 
					УровеньЖурналаРегистрации.Ошибка,,, 
					КоментВЖурнал);
				СписокРеализацийСтруктура.Вставить("Договор", Выборка.Договор);
				СписокРеализацийСтруктура.Вставить("Реализация", );
			КонецПопытки;
			
		Иначе
			
			Инфо = ИнформацияОбОшибке();
			ЗаписьЖурналаРегистрации("Обработка Массовое создание актов", 
				УровеньЖурналаРегистрации.Ошибка,,, 
				Инфо);
			СписокРеализацийСтруктура.Вставить("Договор", Выборка.Договор);
			СписокРеализацийСтруктура.Вставить("Реализация", );
			
		КонецЕсли;
		
		СписокРеализацийМассив.Добавить(СписокРеализацийСтруктура);
		
	КонецЦикла; 
		
	Возврат СписокРеализацийМассив;
	
КонецФункции 

#КонецОбласти

#КонецЕсли
